оперативныйучет2/src/InformationRegisters/НастройкиПередачиВПереработку/НастройкиПередачиВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПередачиВПереработку</name>
  <resources>
    <name>ФормироватьДокументыПередачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкладПоступленияОтДавальца</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПереработчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорПереработки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизацияПереаботчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартнерДавалецСырья</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорПоступленияСырья</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

оперативныйучет2/src/Documents/оуп_ПакетДокументовПередачиПереработчику/оуп_ПакетДокументовПередачиПереработчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>оуп_ПакетДокументовПередачиПереработчику</name>
  <attributes>
    <name>ОрганизацияОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Переработчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПереработки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерДавалец</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоступления</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

оперативныйучет2/src/Documents/ПередачаТоваровХранителю/ПередачаТоваровХранителю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c7c0ead6-40db-47cd-85f3-e065d7c82f48">
  <name>ПередачаТоваровХранителю</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c34ac0af-a5e9-4320-82f6-f9b31b4c6793">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7010dedc-b312-4320-b4c9-8fbb473d8133">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a55bdb4e-bf3e-42df-a984-188dda0c6837">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1968918-6d39-439f-b406-cc078a0e06a4">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b72e7b9-e43a-47fc-afc9-6057cb5e53ec">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6eead0a5-6f6a-46bf-8844-8f1944b7dcaa">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f83cad-3214-4818-ba4a-cf01d7b1e5f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="cf556c65-fe1f-4ae9-a843-17287f8a810d">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="53f5d55e-fbb4-47c8-a767-064960e22e35">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2569045d-51ee-4357-a23f-a5f404c75325">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1571eb11-b228-4191-bae3-6369a96f1eae">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e4d02c34-e005-4187-9e10-5f85e61c2e42">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b42f938b-a75d-420e-91cd-6012d0d04ebe">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1bf79f2e-558e-407f-9d8c-b52009d1bd00">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bda6c76b-c2c2-4841-83ca-1ef894aaace0">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9673ab19-498a-413a-a8ae-e063d277fbad">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a033e5d3-406a-47e3-a1b3-76c68c32ebaa">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="86168fd9-ac0b-41b0-8bad-588df1098e10">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5e44032e-b664-4277-98b2-3500c4b1c25e">
      <name>СтатусУказанияСерийНаСкладах</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4044ee08-d38e-496f-8bda-35cb3bf6d2fb">
      <name>СтатусУказанияСерийПереданныхТоваров</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fe3ce907-bdab-443a-a451-939ce5cfea67">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

оперативныйучет2/src/CommonModules/оуп_ПередачаВПереработку/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс
Функция ПолучитьПараметрыПередачиВПроизводство(Параметры) Экспорт
	//@skip-check structure-consructor-too-many-keys
	сткВозврат = новый Структура("Код, Организация, ПереработчикПартнер, ДоговорПереработки, 
	|ОрганизацияПереаботчик, ПартнерДавалецСырья, ДоговорПоступленияСырья");
	сткВозврат.Код = 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиПередачиВПереработку.Организация,
		|	НастройкиПередачиВПереработку.ПереработчикПартнер,
		|	НастройкиПередачиВПереработку.ДоговорПереработки,
		|	НастройкиПередачиВПереработку.ОрганизацияПереаботчик,
		|	НастройкиПередачиВПереработку.ПартнерДавалецСырья,
		|	НастройкиПередачиВПереработку.ДоговорПоступленияСырья
		|ИЗ
		|	РегистрСведений.НастройкиПередачиВПереработку КАК НастройкиПередачиВПереработку
		|ГДЕ
		|	НастройкиПередачиВПереработку.ФормироватьДокументыПередачи
		|	И НастройкиПередачиВПереработку.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(сткВозврат, ВыборкаДетальныеЗаписи);
		сткВозврат.Код = 1;
	КонецЦикла;
	
	Возврат сткВозврат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПередачаПереработчику
// Создает документ передачи переработчику. 2.5
//@skip-check doc-comment-export-function-return-section
//@skip-check doc-comment-parameter-section
Функция СформироватьДокументПередачи(сткНастройки, ПакетДокументов) Экспорт 
	Если Ложь Тогда
		ПакетДокументов = документы.оуп_ПакетДокументовПередачиПереработчику.СоздатьДокумент();
	КонецЕсли;
	
	
	//документ = документы.ПередачаСырьяПереработчику.СоздатьДокумент();
	документ = документы.ПередачаТоваровХранителю.СоздатьДокумент();
	документ.Заполнить(Неопределено);
	Документ.Дата = ТекущаяДатаСеанса() ;
	Документ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ЗаполнитьЗначенияСвойств(Документ,сткНастройки);
	для Каждого СтрокаТовар из ПакетДокументов.Товары Цикл 
		СтрокаДокумента = документ.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаТовар);
		СтрокаДокумента.КоличествоУпаковок = СтрокаДокумента.Количество;
		СтрокаДокумента.Склад = Документ.Склад;
		если ЗначениеЗаполнено(СтрокаТовар.Серия) Тогда 
			СтрокаДокумента.СтатусУказанияСерий = 14;	
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьСтатусУказанияСерийПередачаВПереработчику_25(Документ);

	Возврат документ;
КонецФункции // СформироватьДокументПередачи()

//Статусы укащания серий передача переработчику 2.5
Процедура ЗаполнитьСтатусУказанияСерийПередачаВПереработчику_25(Документ)
	
	МенеджерОбъекта = Документы.ПередачаТоваровХранителю;
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
	НоменклатураСервер.ПараметрыУказанияСерий(Документ, МенеджерОбъекта)
	);
		
	ПроверитьСериюРассчитатьСтатус = Новый Структура;
	ПроверитьСериюРассчитатьСтатус.Вставить("Склад",                  документ.Склад);
	ПроверитьСериюРассчитатьСтатус.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус",        ПроверитьСериюРассчитатьСтатус);
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(документ.Товары, СтруктураДействий, Неопределено);
	
КонецПроцедуры
#КонецОбласти

#Область ПуступлениеУПереработчика
// Создает документ поступления товаров у Переработчика от Давальца 
// Приобретение товаров
//@skip-check doc-comment-export-function-return-section
//@skip-check doc-comment-parameter-section
Функция  СформироватьДокументПоступления(сткНастройки, тчТовары) Экспорт 
	
	документ = документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	документ.Заполнить(Неопределено);
	
	документ.Дата = ТекущаяДатаСеанса();
	
	ЗаполнитьЗначенияСвойств(документ, сткНастройки); 
	документ.Комментарий = "#ПоступлениеСырьяОтДавальца.";
	документ.НаименованиеВходящегоДокумента= "Передача сырья переработчику";
	документ.Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(Документ.Партнер);
	
	
	ПараметрыЗаполнения = Документы.ПриобретениеТоваровУслуг.ПараметрыЗаполненияНалогообложенияНДСЗакупки(документ);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(документ.НалогообложениеНДС, ПараметрыЗаполнения, Неопределено);
	
	ПараметрыЗаполнения = Документы.ПриобретениеТоваровУслуг.ПараметрыЗаполненияВидаДеятельностиНДС(документ);
	
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(документ.ЗакупкаПодДеятельность, ПараметрыЗаполнения, неопределено);
	
	документ.ВариантПриемкиТоваров = ЗакупкиСервер.ПолучитьВариантПриемкиТоваров();
	
	если не ЗначениеЗаполнено (документ.ВалютаВзаиморасчетов) тогда
		документ.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
	конецесли;
	
	если не ЗначениеЗаполнено (документ.Валюта) тогда
		документ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	конецесли;
	
	для Каждого СтрокаТовар из тчТовары Цикл 
		СтрокаДокумента = Документ.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаТовар);
		СтрокаДокумента.КоличествоУпаковок = СтрокаДокумента.Количество;
		СтрокаДокумента.СтавкаНДС = СтрокаДокумента.Номенклатура.СтавкаНДС;
		//@skip-check wrong-type-expression
		СтрокаДокумента.Цена = 0.01;
		//@skip-check wrong-type-expression
		СтрокаДокумента.Сумма = СтрокаДокумента.Количество * СтрокаДокумента.Цена;
		СтрокаДокумента.СуммаСНДС = СтрокаДокумента.Сумма;
		СтрокаДокумента.Склад = документ.Склад;
		
	КонецЦикла;
	СтатусУказанияСерийПоступление(Документ);
	
	документ.СуммаДокумента = документ.Товары.Итог("СуммаСНДС");
	
	
	
	Возврат документ;
КонецФункции // СформироватьДокументПоступления()

//Статусы указания серий для поступления товаров
Процедура СтатусУказанияСерийПоступление(документ)
	СтруктураДействий = новый Структура;
	ПараметрыУказанияСерий = документы.ПриобретениеТоваровУслуг.ПараметрыУказанияСерий(Документ);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Документ.Склад, ПараметрыУказанияСерий));
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Документ.Товары, СтруктураДействий, Неопределено);
	
КонецПроцедуры
#КонецОбласти


#КонецОбласти
